Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
/*
 * Micro serial-controlled simulator for nRF9151 DK + Onomondo SoftSIM.
 *
 * Clean-slate application goals:
 * - Keep Onomondo external SoftSIM provisioning over serial.
 * - Work with a provisioned SoftSIM over LTE-M when LTE-M is available.
 * - Work without a provisioned SoftSIM by relaying through a Windows laptop.
 * - Let the user choose LTE TCP or serial/Wi-Fi relay transport.
 * - Keep the TCP socket open after connect.
 * - Send Micro heartbeat/location packets on command.
 * - Receive server responses in both LTE and relay modes.
 *
 * Protocol rules implemented by this revision:
 * - Every multi-byte integer in the Micro packet uses big-endian/network byte order.
 * - Length is a big-endian uint16 counting Command + Payload bytes.
 * - CRC is CRC-16/XMODEM (poly 0x1021, init 0x0000, xorout 0x0000).
 * - CRC covers Payload only (the bytes after Command).
 * - CRC is written big-endian in the packet.
 * - Sequence ID, timestamp, lastUpdate, coordinates, accuracy, and speed
 *   are all written big-endian.
 * - Timestamp is uint64 big-endian Unix time in milliseconds since
 *   1970-01-01T00:00:00Z (UTC). A value of zero means unavailable.
 */

#include <ctype.h>
#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/types.h>
#include <unistd.h>

#include <zephyr/device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/logging/log_ctrl.h>
#include <zephyr/net/socket.h>
#include <zephyr/settings/settings.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/sys/util.h>

#include <modem/lte_lc.h>
#include <modem/nrf_modem_lib.h>

#include <nrf_softsim.h>

#include "micro_settings.h"

LOG_MODULE_REGISTER(micro_simulator, LOG_LEVEL_INF);

#define DEFAULT_SERVER_IP "137.184.163.176"
#define DEFAULT_SERVER_PORT 5000
#define DEFAULT_IMEI "861352064050787"
#define DEFAULT_TIMESTAMP_UNIX_MS 1784640600000ULL /* 2026-07-21T13:30:00.000Z */
#define DEFAULT_TIMESTAMP_STEP_MS 5000ULL
#define DEFAULT_FIX_AGE_SECONDS 0U

/* Coordinates are signed int32 values in big-endian byte order.
 * Stored integer = decimal degrees x 1,000,000.
 */
#define MICRO_COORD_SCALE 1000000

#define PROFILE_MAX_SIZE 1024
#define PROFILE_IDLE_DONE_MS 2500
#define CLI_LINE_MAX 1024
#define MAX_PACKET_BYTES 512
#define MAX_HEX_CHARS ((MAX_PACKET_BYTES * 2) + 1)
#define SERVER_RESPONSE_MAX 1024
#define SETTINGS_ERROR_TEXT_MAX 96

#define TCP_RECV_POLL_MS 1000
#define TCP_UPDATE_WAIT_MS 5000
#define RELAY_PREFIX_MAX 64
#define MICRO_HEARTBEAT_STACK_SIZE 4096

K_SEM_DEFINE(lte_connected, 0, 1);

static const struct device *const uart_dev = DEVICE_DT_GET(DT_NODELABEL(uart0));

/* Corrected known-good packets generated from the default simulator state.
 * Sequence ID is 1 in each fixed sample. CRC covers Payload only and is
 * serialized big-endian.
 */
static const char SAMPLE_HB_BEACON[] =
    "AB10002569FD0001013836313335323036343035303738370000019F84DE77C0010107FF0101010FAC91003B91";

static const char SAMPLE_HB_GPS[] =
    "AB10002BFA890001013836313335323036343035303738370000019F84DE77C0010107FF01011002B513BCFB7CF3D000FF0000";

static const char SAMPLE_LOCATION[] =
    "AB10002867C80001103836313335323036343035303738370000019F84DE77C0010107FF02B513BCFB7CF3D000FF0000";

enum wire_mode {
    /* ASCII-HEX sends characters such as 'A' and 'B' (bytes 0x41, 0x42).
     * Binary sends the actual packet header byte 0xAB. Binary is the default
     * integration mode; ASCII-HEX is retained for readable diagnostics.
     */
    WIRE_ASCII_HEX = 0,
    WIRE_BINARY = 1,
};

enum transport_mode {
    TRANSPORT_LTE_TCP = 0,
    TRANSPORT_SERIAL_RELAY = 1,
};

enum heartbeat_opcode {
    OPCODE_BEACON = 0x01,
    OPCODE_GPS_SAFEZONE = 0x0A,
    OPCODE_GPS_LTE = 0x10,
    OPCODE_TRUSTED = 0xA0,
};

enum timestamp_mode {
    TIMESTAMP_FIXED = 0,
    TIMESTAMP_RUNNING = 1,
    TIMESTAMP_STEP = 2,
};

struct sim_state {
    char server_ip[16];
    uint16_t server_port;
    int tcp_fd;
    bool tcp_connected;
    bool relay_connected;
    enum wire_mode mode;
    enum transport_mode transport;

    bool softsim_provisioned;
    bool modem_initialized;
    bool lte_connecting;
    bool lte_registered;

    uint16_t sequence_id;
    char imei[17];

    uint8_t battery;      /* 0x00 low, 0x01 medium, 0x10 high */
    uint8_t charging;     /* 0x01 not charging, 0x10 charging */
    uint16_t last_update; /* minutes */
    uint8_t sw_version;
    uint8_t fw_version;
    uint8_t opcode;

    enum timestamp_mode timestamp_mode;
    uint64_t timestamp_base_ms;
    int64_t timestamp_base_uptime_ms;
    uint64_t timestamp_step_ms;
    uint32_t location_fix_age_seconds;

    int32_t lat_e6;
    int32_t lon_e6;
    uint16_t accuracy_x10;
    uint16_t speed_x10;

    uint8_t beacon_mac[6];
    uint8_t trusted_addr[6]; /* currently detected trusted-device identity */
};

static struct sim_state state = {
    .server_ip = DEFAULT_SERVER_IP,
    .server_port = DEFAULT_SERVER_PORT,
    .tcp_fd = -1,
    .tcp_connected = false,
    .relay_connected = false,
    .mode = WIRE_BINARY,
    .transport = TRANSPORT_SERIAL_RELAY,
    .softsim_provisioned = false,
    .modem_initialized = false,
    .lte_connecting = false,
    .lte_registered = false,
    .sequence_id = 1,
    .imei = DEFAULT_IMEI,
    .battery = 0x01,
    .charging = 0x01,
    .last_update = 2047,
    .sw_version = 1,
    .fw_version = 1,
    .opcode = OPCODE_BEACON,
    .timestamp_mode = TIMESTAMP_FIXED,
    .timestamp_base_ms = DEFAULT_TIMESTAMP_UNIX_MS,
    .timestamp_base_uptime_ms = 0,
    .timestamp_step_ms = DEFAULT_TIMESTAMP_STEP_MS,
    .location_fix_age_seconds = DEFAULT_FIX_AGE_SECONDS,
    .lat_e6 = 45421500,
    .lon_e6 = -75697200,
    .accuracy_x10 = 255,
    .speed_x10 = 0,
    .beacon_mac = {0x0F, 0xAC, 0x91, 0x00, 0x3B, 0x91},
    .trusted_addr = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0x01},
};


static struct micro_persistent_config active_config;
static struct micro_settings_apply_result last_config_result;
static int last_config_status;
static char last_config_source[16] = "none";
static char last_config_error[SETTINGS_ERROR_TEXT_MAX];
static uint32_t last_config_uptime_ms;
static uint16_t next_update_id = 1U;

