Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
static size_t server_response_buffer_len;
static bool awaiting_settings_packet;

/* These buffers are shared by the serialized application paths below.  Keeping
 * them out of the system workqueue/main-thread frames is intentional: a
 * heartbeat may receive a response and parse settings before it returns.
 */
struct micro_transport_buffers {
    uint8_t packet[MAX_PACKET_BYTES];
    uint8_t payload[MAX_PACKET_BYTES];
    uint8_t binary[SERVER_RESPONSE_MAX];
    uint8_t response[SERVER_RESPONSE_MAX];
    char hex[MAX_HEX_CHARS];
    char token[96];
};

static struct micro_transport_buffers transport_buffers;

struct micro_settings_parse_context {
    char error_text[SETTINGS_ERROR_TEXT_MAX];
    struct micro_settings_apply_result result;
    struct micro_persistent_config candidate;
    struct micro_persistent_config previous;
};

static struct micro_settings_parse_context settings_parse_context;
static char softsim_profile[PROFILE_MAX_SIZE];
static char cli_line[CLI_LINE_MAX];

K_MUTEX_DEFINE(micro_transport_mutex);
K_SEM_DEFINE(micro_heartbeat_trigger, 0, 1);

static void heartbeat_timer_expiry(struct k_timer *timer);
K_TIMER_DEFINE(micro_heartbeat_timer, heartbeat_timer_expiry, NULL);

static void heartbeat_thread(void *p1, void *p2, void *p3);
K_THREAD_DEFINE(micro_heartbeat, MICRO_HEARTBEAT_STACK_SIZE, heartbeat_thread,
                NULL, NULL, NULL, 5, 0, 0);

static k_tid_t micro_main_thread;

/* Forward declarations. Keep these above provisioning code because C99 does not
 * allow implicit function declarations, and Zephyr builds with strict flags.
 */
static int hex_nibble(char c);
static int hex_to_bytes(const char *hex, uint8_t *out, size_t out_max, size_t *out_len);
static void bytes_to_hex(const uint8_t *bytes, size_t len, char *hex, size_t hex_len);
static void tcp_disconnect(void);
static int tcp_connect_to_server(const char *ip, uint16_t port);
static int tcp_recv_response(void);
static int tcp_send_hex_payload(const char *hex);
static void relay_disconnect(void);
static int relay_connect_to_server(const char *ip, uint16_t port);
static int relay_send_hex_payload(const char *hex);
static int transport_send_hex_payload(const char *hex);
static int modem_prepare(void);
static int lte_connect_start(void);
static int process_server_response_bytes(const uint8_t *data, size_t len, const char *source);
static void schedule_next_heartbeat(void);
static int apply_settings_packet_bytes(const uint8_t *packet, size_t packet_len, const char *source);
static void print_hex6(const uint8_t v[6]);


static void drain_logs_and_reboot(void)
{
    while (log_data_pending()) {
        log_process();
        k_yield();
    }

    sys_reboot(0);
}


/* -------------------------------------------------------------------------- */
/* Robust serial input                                                        */
/* -------------------------------------------------------------------------- */

/*
 * Use UART interrupt input instead of polling.
 * Polling can miss bytes when a full SoftSIM profile is pasted quickly from a
 * terminal. The previous working firmware used interrupt-driven input, so this
 * version keeps that behavior for both SoftSIM provisioning and the CLI.
 */
K_MSGQ_DEFINE(serial_char_msgq, sizeof(uint8_t), 2048, 4);

static void serial_uart_cb(const struct device *dev, void *user_data)
{
    ARG_UNUSED(user_data);

    if (!uart_irq_update(dev)) {
        return;
    }

    while (uart_irq_rx_ready(dev)) {
        uint8_t c;
        int rx = uart_fifo_read(dev, &c, 1);

        if (rx <= 0) {
            return;
        }

        (void)k_msgq_put(&serial_char_msgq, &c, K_NO_WAIT);
    }
}

static int serial_input_start(void)
{
    if (!device_is_ready(uart_dev)) {
        LOG_ERR("UART device not ready");
        return -ENODEV;
    }

    int err = uart_irq_callback_user_data_set(uart_dev, serial_uart_cb, NULL);
    if (err) {
        LOG_ERR("Failed to set UART callback: %d", err);
        return err;
    }

    uart_irq_rx_enable(uart_dev);
    return 0;
}

static int serial_get_char(uint8_t *c, k_timeout_t timeout)
{
    return k_msgq_get(&serial_char_msgq, c, timeout);
}

static int read_line_serial(char *buf, size_t buf_len, bool echo)
{
    size_t pos = 0;

    if (buf_len == 0) {
        return -EINVAL;
    }

    memset(buf, 0, buf_len);

    while (true) {
        uint8_t c;
        int err = serial_get_char(&c, K_FOREVER);
        if (err) {
            return err;
        }

        if (c == '\r' || c == '\n') {
            if (echo) {
                printk("\r\n");
            }
            buf[pos] = '\0';
            return (int)pos;
        }

        if (c == 0x08 || c == 0x7F) {
            if (pos > 0) {
                pos--;
                buf[pos] = '\0';
                if (echo) {
                    printk("\b \b");
                }
            }
            continue;
        }

        if (pos < buf_len - 1) {
            buf[pos++] = (char)c;
            if (echo) {
                uart_poll_out(uart_dev, c);
            }
        }
    }
}

static int read_softsim_profile(char *buf, size_t buf_len)
{
    size_t pos = 0;
    bool started = false;
    size_t visible_count = 0;

    if (buf_len == 0) {
        return -EINVAL;
    }

    memset(buf, 0, buf_len);

    while (true) {
        uint8_t c;
        k_timeout_t timeout = started ? K_MSEC(PROFILE_IDLE_DONE_MS) : K_FOREVER;
        int err = serial_get_char(&c, timeout);

        if (err == -EAGAIN) {
            if (started) {
                buf[pos] = '\0';
                printk("\r\n");
                return (int)pos;
            }
            continue;
        }

        if (err) {
            return err;
        }

        if (c == '\r' || c == '\n' || c == ' ' || c == '\t') {
            /* Ignore whitespace so profiles copied with wrapping still work. */
            continue;
        }

        if (hex_nibble((char)c) < 0) {
            printk("\r\nInvalid non-hex character received: 0x%02X\r\n", c);
            return -EINVAL;
        }

        started = true;

