Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
        if (pos >= buf_len - 1) {
            printk("\r\nSoftSIM profile too long for buffer\r\n");
            return -ENOMEM;
        }

        buf[pos++] = (char)c;

        /* Progress indicator without printing the secret profile. */
        visible_count++;
        if ((visible_count % 64) == 0) {
            printk(".");
        }
    }
}

static int provision_softsim_from_serial(void)
{
    if (!device_is_ready(uart_dev)) {
        LOG_ERR("UART device not ready");
        return -ENODEV;
    }

    LOG_INF("Transfer SoftSIM profile using serial COM port.");
    LOG_INF("Paste the complete HEX profile. Whitespace and line breaks are ignored.");
    LOG_INF("After paste, wait about 3 seconds; the firmware will provision automatically.");

    int len = read_softsim_profile(softsim_profile, sizeof(softsim_profile));
    if (len <= 0) {
        LOG_ERR("Invalid SoftSIM profile length: %d", len);
        return -EINVAL;
    }

    LOG_INF("Profile received: %d hex characters in total", len);

    if ((len % 2) != 0) {
        LOG_ERR("SoftSIM profile has odd hex character count; profile is incomplete");
        return -EINVAL;
    }

    int err = nrf_softsim_provision((uint8_t *)softsim_profile, (size_t)len);
    if (err != 0) {
        LOG_ERR("SoftSIM profile provisioning failed: %d", err);
        LOG_ERR("Most common cause: only part of the profile was pasted or the profile contains extra text.");
        return err;
    }

    LOG_INF("SoftSIM provisioned; rebooting");
    drain_logs_and_reboot();

    return 0;
}

static void lte_handler(const struct lte_lc_evt *const evt)
{
    switch (evt->type) {
    case LTE_LC_EVT_NW_REG_STATUS:
        if ((evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME) ||
            (evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_ROAMING)) {
            state.lte_registered = true;
            state.lte_connecting = false;
            LOG_INF("Network registration status: %s",
                evt->nw_reg_status == LTE_LC_NW_REG_REGISTERED_HOME ?
                "Connected - home network" : "Connected - roaming");
            k_sem_give(&lte_connected);
        } else {
            state.lte_registered = false;
        }
        break;

    case LTE_LC_EVT_RRC_UPDATE:
        LOG_INF("RRC mode: %s",
            evt->rrc_mode == LTE_LC_RRC_MODE_CONNECTED ? "Connected" : "Idle");
        break;

    case LTE_LC_EVT_CELL_UPDATE:
        LOG_INF("LTE cell changed: Cell ID: %d, Tracking area: %d",
            evt->cell.id, evt->cell.tac);
        break;

    default:
        break;
    }
}

static int modem_prepare(void)
{
    if (!state.softsim_provisioned) {
        printk("SoftSIM is not provisioned. Use relay mode or run: softsim provision\r\n");
        return -ENODEV;
    }

    if (state.modem_initialized) {
        return 0;
    }

    int err = nrf_modem_lib_init();
    if (err) {
        LOG_ERR("Failed to initialize modem library: %d", err);
        return err;
    }

    state.modem_initialized = true;
    return 0;
}

static int lte_connect_start(void)
{
    if (state.lte_registered) {
        printk("LTE is already connected\r\n");
        return 0;
    }

    if (state.lte_connecting) {
        printk("LTE connection is already in progress\r\n");
        return 0;
    }

    int err = modem_prepare();
    if (err) {
        return err;
    }

    err = lte_lc_connect_async(lte_handler);
    if (err) {
        LOG_ERR("Connecting to LTE network failed: %d", err);
        return err;
    }

    state.lte_connecting = true;
    LOG_INF("LTE connection started in background");
    return 0;
}

static int hex_nibble(char c)
{
    if (c >= '0' && c <= '9') {
        return c - '0';
    }
    if (c >= 'a' && c <= 'f') {
        return c - 'a' + 10;
    }
    if (c >= 'A' && c <= 'F') {
        return c - 'A' + 10;
    }
    return -1;
}

static int hex_to_bytes(const char *hex, uint8_t *out, size_t out_max, size_t *out_len)
{
    int high = -1;
    size_t len = 0;

    for (size_t i = 0; hex[i] != '\0'; i++) {
        if (isspace((unsigned char)hex[i])) {
            continue;
        }

        int n = hex_nibble(hex[i]);
        if (n < 0) {
            return -EINVAL;
        }

        if (high < 0) {
            high = n;
        } else {
            if (len >= out_max) {
                return -ENOMEM;
            }
            out[len++] = (uint8_t)((high << 4) | n);
            high = -1;
        }
    }

    if (high >= 0) {
        return -EINVAL;
    }

    *out_len = len;
    return 0;
}

static void bytes_to_hex(const uint8_t *bytes, size_t len, char *hex, size_t hex_len)
{
    static const char digits[] = "0123456789ABCDEF";

    if (hex_len < (len * 2) + 1) {
        if (hex_len > 0) {
            hex[0] = '\0';
        }
        return;
    }

    for (size_t i = 0; i < len; i++) {
        hex[i * 2] = digits[(bytes[i] >> 4) & 0x0F];
        hex[(i * 2) + 1] = digits[bytes[i] & 0x0F];
    }
    hex[len * 2] = '\0';
}

static void append_u8(uint8_t *buf, size_t *len, uint8_t v)
{
    buf[(*len)++] = v;
}

static void append_u16_be(uint8_t *buf, size_t *len, uint16_t v)
{
    buf[(*len)++] = (uint8_t)((v >> 8) & 0xFF);
    buf[(*len)++] = (uint8_t)(v & 0xFF);
}

static void append_u64_be(uint8_t *buf, size_t *len, uint64_t v)
{
    buf[(*len)++] = (uint8_t)((v >> 56) & 0xFF);
    buf[(*len)++] = (uint8_t)((v >> 48) & 0xFF);
    buf[(*len)++] = (uint8_t)((v >> 40) & 0xFF);
    buf[(*len)++] = (uint8_t)((v >> 32) & 0xFF);
    buf[(*len)++] = (uint8_t)((v >> 24) & 0xFF);
    buf[(*len)++] = (uint8_t)((v >> 16) & 0xFF);
    buf[(*len)++] = (uint8_t)((v >> 8) & 0xFF);
    buf[(*len)++] = (uint8_t)(v & 0xFF);
}

static void append_i32_be(uint8_t *buf, size_t *len, int32_t v)
{
    uint32_t u = (uint32_t)v;
    buf[(*len)++] = (uint8_t)((u >> 24) & 0xFF);
    buf[(*len)++] = (uint8_t)((u >> 16) & 0xFF);
    buf[(*len)++] = (uint8_t)((u >> 8) & 0xFF);
    buf[(*len)++] = (uint8_t)(u & 0xFF);
}

static void append_bytes(uint8_t *buf, size_t *len, const uint8_t *src, size_t src_len)
{
    memcpy(&buf[*len], src, src_len);
    *len += src_len;
}

/* Exact C equivalent of the CRC routine supplied by the server team.
 * This is CRC-16/XMODEM: poly=0x1021, init=0x0000, refin=false,
 * refout=false, xorout=0x0000. The check value for ASCII "123456789"
 * is 0x31C3.
 */
static uint16_t calculate_crc16(const uint8_t *data, size_t data_len, uint16_t initial_crc)
{
    uint16_t crc = initial_crc;

    for (size_t i = 0; i < data_len; i++) {
        crc = (uint16_t)(((uint8_t)(crc >> 8)) | (uint16_t)(crc << 8));
        crc ^= data[i];
        crc ^= (uint16_t)(((uint8_t)(crc & 0xFF)) >> 4);
        crc ^= (uint16_t)((crc << 8) << 4);
        crc ^= (uint16_t)((((crc & 0xFF) << 4)) << 1);
    }

