Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
    return crc;
}


static int persistent_settings_set(const char *name, size_t len,
                                   settings_read_cb read_cb, void *cb_arg)
{
    if (strcmp(name, "config") != 0) {
        return -ENOENT;
    }
    if (len != sizeof(active_config)) {
        return -EMSGSIZE;
    }
    ssize_t read_len = read_cb(cb_arg, &active_config, sizeof(active_config));
    if (read_len != sizeof(active_config)) {
        return read_len < 0 ? (int)read_len : -EIO;
    }
    return micro_settings_validate_config(&active_config);
}

SETTINGS_STATIC_HANDLER_DEFINE(micro_config, "micro", NULL,
                               persistent_settings_set, NULL, NULL);

static int save_active_config(const struct micro_persistent_config *candidate)
{
    if (micro_settings_validate_config(candidate) != 0) {
        return -EINVAL;
    }
    if (memcmp(candidate, &active_config, sizeof(*candidate)) == 0) {
        return 0;
    }
    int err = settings_save_one("micro/config", candidate, sizeof(*candidate));
    if (err == 0) {
        active_config = *candidate;
    }
    return err;
}

static int persistent_settings_init(void)
{
    micro_settings_defaults(&active_config);
    int err = settings_subsys_init();
    if (err != 0 && err != -EALREADY) {
        LOG_ERR("settings subsystem init failed: %d", err);
        return err;
    }
    err = settings_load_subtree("micro");
    if (err != 0 || micro_settings_validate_config(&active_config) != 0) {
        LOG_WRN("No valid stored simulator configuration; using defaults");
        micro_settings_defaults(&active_config);
        err = settings_save_one("micro/config", &active_config, sizeof(active_config));
        if (err != 0) {
            LOG_ERR("Could not store default simulator configuration: %d", err);
            return err;
        }
    }
    return 0;
}

static void record_config_result(int status, const char *source,
                                 const struct micro_settings_apply_result *result,
                                 const char *error_text)
{
    last_config_status = status;
    last_config_uptime_ms = (uint32_t)k_uptime_get_32();
    snprintf(last_config_source, sizeof(last_config_source), "%s", source ? source : "unknown");
    snprintf(last_config_error, sizeof(last_config_error), "%s", error_text ? error_text : "");
    if (result != NULL) {
        last_config_result = *result;
    } else {
        memset(&last_config_result, 0, sizeof(last_config_result));
    }
}

static void append_imei(uint8_t *buf, size_t *len)
{
    /* Protocol document states 16 bytes but examples show 15 ASCII digits.
     * Use 15 ASCII digits to match current example strings.
     */
    size_t imei_len = strlen(state.imei);
    if (imei_len > 15) {
        imei_len = 15;
    }
    append_bytes(buf, len, (const uint8_t *)state.imei, imei_len);
}

static int32_t coord_for_protocol(int32_t e6)
{
#if MICRO_COORD_SCALE == 1000000
    return e6;
#elif MICRO_COORD_SCALE == 100000
    return e6 / 10;
#else
#error "Unsupported MICRO_COORD_SCALE"
#endif
}

static void append_location_fields(uint8_t *buf, size_t *len)
{
    append_i32_be(buf, len, coord_for_protocol(state.lat_e6));
    append_i32_be(buf, len, coord_for_protocol(state.lon_e6));
    append_u16_be(buf, len, state.accuracy_x10);
    append_u16_be(buf, len, state.speed_x10);
}

static const char *timestamp_mode_name(void)
{
    switch (state.timestamp_mode) {
    case TIMESTAMP_FIXED: return "fixed";
    case TIMESTAMP_RUNNING: return "running";
    case TIMESTAMP_STEP: return "step";
    default: return "unknown";
    }
}

static uint64_t simulated_current_time_ms(void)
{
    if (state.timestamp_mode != TIMESTAMP_RUNNING) {
        return state.timestamp_base_ms;
    }

    int64_t elapsed_ms = k_uptime_get() - state.timestamp_base_uptime_ms;
    if (elapsed_ms <= 0) {
        return state.timestamp_base_ms;
    }

    uint64_t elapsed = (uint64_t)elapsed_ms;
    if (UINT64_MAX - state.timestamp_base_ms < elapsed) {
        return UINT64_MAX;
    }
    return state.timestamp_base_ms + elapsed;
}

static uint64_t timestamp_for_packet(bool location_packet)
{
    uint64_t timestamp_ms = simulated_current_time_ms();

    if (location_packet) {
        uint64_t fix_age_ms = (uint64_t)state.location_fix_age_seconds * 1000ULL;
        timestamp_ms = timestamp_ms >= fix_age_ms ? timestamp_ms - fix_age_ms : 0;
    }

    return timestamp_ms;
}

static void advance_step_timestamp_after_packet(void)
{
    if (state.timestamp_mode != TIMESTAMP_STEP) {
        return;
    }

    if (UINT64_MAX - state.timestamp_base_ms < state.timestamp_step_ms) {
        state.timestamp_base_ms = UINT64_MAX;
    } else {
        state.timestamp_base_ms += state.timestamp_step_ms;
    }
}

static void reset_timestamp_uptime_anchor(void)
{
    state.timestamp_base_uptime_ms = k_uptime_get();
}

#define PACKET_COMMAND_OFFSET 8U
#define PACKET_PAYLOAD_OFFSET 9U

static void start_packet(uint8_t *buf, size_t *len, uint8_t command)
{
    *len = 0;
    append_u8(buf, len, 0xAB);          /* Header */
    append_u8(buf, len, 0x10);          /* Property */
    append_u8(buf, len, 0x00);          /* Length placeholder, high */
    append_u8(buf, len, 0x00);          /* Length placeholder, low */
    append_u8(buf, len, 0x00);          /* CRC placeholder, high */
    append_u8(buf, len, 0x00);          /* CRC placeholder, low */
    append_u16_be(buf, len, state.sequence_id);
    append_u8(buf, len, command);
}

static int finalize_packet(uint8_t *buf, size_t len)
{
    if (len < PACKET_PAYLOAD_OFFSET || len > UINT16_MAX + 8U) {
        return -EINVAL;
    }

    /* Length counts Command + Payload, so it is total packet length minus
     * the eight bytes before Command.
     */
    uint16_t body_len = (uint16_t)(len - PACKET_COMMAND_OFFSET);
    buf[2] = (uint8_t)((body_len >> 8) & 0xFF);
    buf[3] = (uint8_t)(body_len & 0xFF);

    /* The server team specified CRC over Payload only. Command is not part
     * of the CRC input. Store the resulting uint16 big-endian.
     */
    uint16_t crc = calculate_crc16(&buf[PACKET_PAYLOAD_OFFSET],
                                   len - PACKET_PAYLOAD_OFFSET,
                                   0x0000);
    buf[4] = (uint8_t)((crc >> 8) & 0xFF);
    buf[5] = (uint8_t)(crc & 0xFF);

