Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
    return 0;
}

static int build_heartbeat_hex(char *hex, size_t hex_len)
{
    uint8_t *pkt = transport_buffers.packet;
    size_t len;

    start_packet(pkt, &len, 0x01);
    append_imei(pkt, &len);
    append_u64_be(pkt, &len, timestamp_for_packet(false));
    append_u8(pkt, &len, state.battery);
    append_u8(pkt, &len, state.charging);
    append_u16_be(pkt, &len, state.last_update);
    append_u8(pkt, &len, state.sw_version);
    append_u8(pkt, &len, state.fw_version);
    append_u8(pkt, &len, state.opcode);

    if (state.opcode == OPCODE_BEACON) {
        append_bytes(pkt, &len, state.beacon_mac, sizeof(state.beacon_mac));
    } else if (state.opcode == OPCODE_TRUSTED) {
        append_bytes(pkt, &len, state.trusted_addr, sizeof(state.trusted_addr));
    } else if (state.opcode == OPCODE_GPS_SAFEZONE || state.opcode == OPCODE_GPS_LTE) {
        append_location_fields(pkt, &len);
    } else {
        return -EINVAL;
    }

    /* Version 7 trusted-device extension. This is the configured registry,
     * independent of the opcode-selected device currently detected nearby.
     */
    append_u8(pkt, &len, active_config.trusted_device_count);
    for (uint8_t i = 0U; i < MICRO_MAX_TRUSTED_DEVICES; ++i) {
        append_bytes(pkt, &len, active_config.trusted_devices[i], MICRO_DEVICE_ID_BYTES);
    }

    int err = finalize_packet(pkt, len);
    if (err) {
        return err;
    }

    bytes_to_hex(pkt, len, hex, hex_len);
    state.sequence_id++;
    advance_step_timestamp_after_packet();

    return 0;
}

static int build_location_hex(char *hex, size_t hex_len)
{
    uint8_t *pkt = transport_buffers.packet;
    size_t len;

    start_packet(pkt, &len, 0x10);
    append_imei(pkt, &len);
    append_u64_be(pkt, &len, timestamp_for_packet(true));
    append_u8(pkt, &len, state.battery);
    append_u8(pkt, &len, state.charging);
    append_u16_be(pkt, &len, state.last_update);
    append_location_fields(pkt, &len);

    int err = finalize_packet(pkt, len);
    if (err) {
        return err;
    }

    bytes_to_hex(pkt, len, hex, hex_len);
    state.sequence_id++;
    advance_step_timestamp_after_packet();

    return 0;
}


static uint16_t read_u16_be(const uint8_t *p)
{
    return (uint16_t)(((uint16_t)p[0] << 8) | p[1]);
}

static int build_settings_update_hex(const char *name, const char *value,
                                     char *hex, size_t hex_len,
                                     uint16_t *generated_update_id)
{
    uint8_t *payload = transport_buffers.payload;
    size_t payload_len = 0U;
    uint16_t update_id = next_update_id++;
    int err = micro_settings_build_single_payload(state.imei, update_id,
                                                  name, value,
                                                  payload, MAX_PACKET_BYTES,
                                                  &payload_len);
    if (err != 0) {
        return err;
    }
    uint8_t *packet = transport_buffers.packet;
    size_t packet_len = 0U;
    start_packet(packet, &packet_len, MICRO_SETTINGS_COMMAND);
    if (packet_len + payload_len > MAX_PACKET_BYTES) {
        return -ENOSPC;
    }
    append_bytes(packet, &packet_len, payload, payload_len);
    err = finalize_packet(packet, packet_len);
    if (err != 0) {
        return err;
    }
    bytes_to_hex(packet, packet_len, hex, hex_len);
    if (generated_update_id != NULL) {
        *generated_update_id = update_id;
    }
    state.sequence_id++;
    return 0;
}

static int build_settings_config_update_hex(const struct micro_persistent_config *config,
                                            char *hex, size_t hex_len,
                                            uint16_t *generated_update_id)
{
    uint8_t *payload = transport_buffers.payload;
    size_t payload_len = 0U;
    uint16_t update_id = next_update_id++;
    int err = micro_settings_build_config_payload(state.imei, update_id,
                                                   config,
                                                   payload, MAX_PACKET_BYTES,
                                                   &payload_len);
    if (err != 0) {
        return err;
    }
    uint8_t *packet = transport_buffers.packet;
    size_t packet_len = 0U;
    start_packet(packet, &packet_len, MICRO_SETTINGS_COMMAND);
    if (packet_len + payload_len > MAX_PACKET_BYTES) {
        return -ENOSPC;
    }
    append_bytes(packet, &packet_len, payload, payload_len);
    err = finalize_packet(packet, packet_len);
    if (err != 0) {
        return err;
    }
    bytes_to_hex(packet, packet_len, hex, hex_len);
    if (generated_update_id != NULL) {
        *generated_update_id = update_id;
    }
    state.sequence_id++;
    return 0;
}

static void print_settings_changes(const struct micro_persistent_config *previous,
                                   const struct micro_persistent_config *current,
                                   const struct micro_settings_apply_result *result)
{
    for (uint8_t index = 0U; index < result->changed_count; ++index) {
        uint8_t id = result->changed_ids[index];
        const struct micro_setting_definition *definition = micro_setting_by_id(id);
        const char *name = definition != NULL ? definition->name : "unknown";
        if (id == MICRO_SETTING_HEARTBEAT_INTERVAL) {
            printk("setting %s: %u -> %u\r\n", name,
                   previous->heartbeat_interval_seconds,
                   current->heartbeat_interval_seconds);
        } else if (id == MICRO_SETTING_LTE_UPDATE_INTERVAL) {
            printk("setting %s: %u -> %u\r\n", name,
                   previous->lte_update_interval_seconds,
                   current->lte_update_interval_seconds);
        } else if (id == MICRO_SETTING_SLEEP_INTERVAL) {
            printk("setting %s: %u -> %u\r\n", name,
                   previous->sleep_interval_seconds,
                   current->sleep_interval_seconds);
        } else if (id == MICRO_SETTING_SAFE_ZONES) {
            printk("setting %s count: %u -> %u\r\n", name,
                   previous->zone_count, current->zone_count);
            for (uint8_t i = 0U; i < previous->zone_count; ++i) {
                printk("  old[%u]: lat_e7=%d lon_e7=%d radius_m=%u\r\n", i + 1U,
                       previous->zones[i].latitude_e7,
                       previous->zones[i].longitude_e7,
                       previous->zones[i].radius_m);
            }
            for (uint8_t i = 0U; i < current->zone_count; ++i) {
                printk("  new[%u]: lat_e7=%d lon_e7=%d radius_m=%u\r\n", i + 1U,
                       current->zones[i].latitude_e7,
                       current->zones[i].longitude_e7,
                       current->zones[i].radius_m);
            }
        } else if (id == MICRO_SETTING_BEACON_LIST) {
            printk("setting %s count: %u -> %u\r\n", name,
                   previous->beacon_count, current->beacon_count);
            for (uint8_t i = 0U; i < previous->beacon_count; ++i) {
                printk("  old[%u]: ", i + 1U); print_hex6(previous->beacons[i]); printk("\r\n");
            }
            for (uint8_t i = 0U; i < current->beacon_count; ++i) {
                printk("  new[%u]: ", i + 1U); print_hex6(current->beacons[i]); printk("\r\n");
            }
        } else if (id == MICRO_SETTING_TRUSTED_DEVICE_LIST) {
            printk("setting %s count: %u -> %u\r\n", name,
                   previous->trusted_device_count, current->trusted_device_count);
            for (uint8_t i = 0U; i < previous->trusted_device_count; ++i) {
                printk("  old[%u]: ", i + 1U); print_hex6(previous->trusted_devices[i]); printk("\r\n");
            }
            for (uint8_t i = 0U; i < current->trusted_device_count; ++i) {
                printk("  new[%u]: ", i + 1U); print_hex6(current->trusted_devices[i]); printk("\r\n");
            }
        }
    }
}

