Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
static int apply_settings_packet_bytes(const uint8_t *packet, size_t packet_len,
                                       const char *source)
{
    struct micro_settings_parse_context *ctx = &settings_parse_context;
    memset(ctx, 0, sizeof(*ctx));

    if (packet == NULL || packet_len < PACKET_PAYLOAD_OFFSET) {
        record_config_result(-EMSGSIZE, source, NULL, "packet shorter than fixed envelope");
        return -EMSGSIZE;
    }
    if (packet[0] != 0xABU || packet[1] != 0x10U) {
        record_config_result(-EINVAL, source, NULL, "invalid header or property");
        return -EINVAL;
    }
    uint16_t declared = read_u16_be(&packet[2]);
    if ((size_t)declared + PACKET_COMMAND_OFFSET != packet_len) {
        record_config_result(-EMSGSIZE, source, NULL, "length mismatch");
        return -EMSGSIZE;
    }
    if (packet[PACKET_COMMAND_OFFSET] != MICRO_SETTINGS_COMMAND) {
        record_config_result(-EPROTO, source, NULL, "not a settings-update command");
        return -EPROTO;
    }
    uint16_t received_crc = read_u16_be(&packet[4]);
    uint16_t calculated_crc = calculate_crc16(&packet[PACKET_PAYLOAD_OFFSET],
                                              packet_len - PACKET_PAYLOAD_OFFSET,
                                              0x0000);
    if (received_crc != calculated_crc) {
        record_config_result(-EBADMSG, source, NULL, "CRC mismatch");
        return -EBADMSG;
    }

    int err = micro_settings_apply_payload(&packet[PACKET_PAYLOAD_OFFSET],
                                           packet_len - PACKET_PAYLOAD_OFFSET,
                                           state.imei,
                                           &active_config,
                                           &ctx->candidate,
                                           &ctx->result,
                                           ctx->error_text,
                                           sizeof(ctx->error_text));
    if (err != 0) {
        record_config_result(err, source, &ctx->result, ctx->error_text);
        printk("Settings rejected from %s: %s (%d)\r\n",
               source, ctx->error_text, err);
        return err;
    }

    ctx->previous = active_config;
    err = save_active_config(&ctx->candidate);
    if (err != 0) {
        record_config_result(err, source, &ctx->result, "persistent storage write failed");
        printk("Settings validation succeeded but persistence failed: %d\r\n", err);
        return err;
    }

    record_config_result(0, source, &ctx->result, "");
    printk("Settings update %u applied from %s (%u changed setting(s))\r\n",
           ctx->result.update_id, source, ctx->result.changed_count);
    print_settings_changes(&ctx->previous, &active_config, &ctx->result);
    if (ctx->previous.heartbeat_interval_seconds != active_config.heartbeat_interval_seconds) {
        schedule_next_heartbeat();
    }
    return 0;
}

static void tcp_disconnect(void)
{
    if (state.tcp_fd >= 0) {
        zsock_close(state.tcp_fd);
    }
    state.tcp_fd = -1;
    state.tcp_connected = false;
    (void)k_timer_stop(&micro_heartbeat_timer);
    printk("TCP disconnected\r\n");
}

static int tcp_connect_to_server(const char *ip, uint16_t port)
{
    struct sockaddr_in server4;

    if (state.tcp_connected) {
        tcp_disconnect();
    }

    memset(&server4, 0, sizeof(server4));
    server4.sin_family = AF_INET;
    server4.sin_port = htons(port);

    if (zsock_inet_pton(AF_INET, ip, &server4.sin_addr) != 1) {
        printk("Invalid IPv4 address: %s\r\n", ip);
        return -EINVAL;
    }

    int fd = zsock_socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (fd < 0) {
        printk("TCP socket create failed: errno=%d\r\n", errno);
        return -errno;
    }

    printk("Connecting to %s:%u ...\r\n", ip, port);

    if (zsock_connect(fd, (struct sockaddr *)&server4, sizeof(server4)) < 0) {
        int err = -errno;
        printk("TCP connect failed: errno=%d\r\n", errno);
        zsock_close(fd);
        return err;
    }

    state.tcp_fd = fd;
    state.tcp_connected = true;
    strncpy(state.server_ip, ip, sizeof(state.server_ip) - 1);
    state.server_ip[sizeof(state.server_ip) - 1] = '\0';
    state.server_port = port;

    printk("TCP connected to %s:%u\r\n", state.server_ip, state.server_port);
    schedule_next_heartbeat();
    return 0;
}

static int process_server_response_bytes(const uint8_t *data, size_t len,
                                         const char *source)
{
    if (len > sizeof(transport_buffers.response) - server_response_buffer_len) {
        printk("Server response buffer overflow; discarding buffered data\r\n");
        server_response_buffer_len = 0U;
        awaiting_settings_packet = false;
        return -ENOSPC;
    }
    memcpy(&transport_buffers.response[server_response_buffer_len], data, len);
    server_response_buffer_len += len;
    int events = 0;

    while (server_response_buffer_len > 0U) {
        if (awaiting_settings_packet) {
            if (server_response_buffer_len < 4U) {
                break;
            }
            if (transport_buffers.response[0] != 0xABU ||
                transport_buffers.response[1] != 0x10U) {
                printk("Settings packet after SUP has invalid prefix\r\n");
                server_response_buffer_len = 0U;
                awaiting_settings_packet = false;
                return -EBADMSG;
            }
            uint16_t declared = read_u16_be(&transport_buffers.response[2]);
            size_t total = PACKET_COMMAND_OFFSET + declared;
            if (declared < 1U || total > MAX_PACKET_BYTES) {
                printk("Settings packet after SUP has invalid length %u\r\n", declared);
                server_response_buffer_len = 0U;
                awaiting_settings_packet = false;
                return -EMSGSIZE;
            }
            if (server_response_buffer_len < total) {
                break;
            }
            printk("Complete settings packet received from %s (%u bytes)\r\n",
                   source, (unsigned int)total);
            int err = apply_settings_packet_bytes(transport_buffers.response, total, source);
            if (err != 0) {
                printk("Settings packet rejected: %d\r\n", err);
            }
            memmove(transport_buffers.response,
                    &transport_buffers.response[total],
                    server_response_buffer_len - total);
            server_response_buffer_len -= total;
            awaiting_settings_packet = false;
            events++;
            continue;
        }

