Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
        size_t newline = 0U;
        bool found = false;
        for (; newline < server_response_buffer_len; ++newline) {
            if (transport_buffers.response[newline] == '\n') {
                found = true;
                break;
            }
        }
        if (!found) {
            break;
        }
        size_t token_len = newline;
        while (token_len > 0U &&
               (transport_buffers.response[token_len - 1U] == '\r' ||
                transport_buffers.response[token_len - 1U] == ' ')) {
            token_len--;
        }
        size_t copy_len = MIN(token_len, sizeof(transport_buffers.token) - 1U);
        memcpy(transport_buffers.token, transport_buffers.response, copy_len);
        transport_buffers.token[copy_len] = '\0';
        memmove(transport_buffers.response,
                &transport_buffers.response[newline + 1U],
                server_response_buffer_len - newline - 1U);
        server_response_buffer_len -= newline + 1U;
        events++;

        if (strcmp(transport_buffers.token, "OK") == 0) {
            printk("OK received: packet accepted; no settings update pending\r\n");
        } else if (strncmp(transport_buffers.token, "ERROR", 5U) == 0) {
            printk("ERROR received from server: %s\r\n", transport_buffers.token);
        } else if (strcmp(transport_buffers.token, "SUP") == 0) {
            printk("SUP received: settings packet reception started\r\n");
            awaiting_settings_packet = true;
        } else if (strcmp(transport_buffers.token, "FWUP") == 0) {
            printk("FWUP received: firmware update handling is deferred and unsupported\r\n");
        } else if (strcmp(transport_buffers.token, "CONFIG_NONE") == 0) {
            printk("CONFIG_NONE received (legacy diagnostic response)\r\n");
        } else {
            printk("Unknown server response preserved: %s\r\n", transport_buffers.token);
        }
    }
    return events;
}

static int tcp_recv_response(void)
{
    if (!state.tcp_connected || state.tcp_fd < 0) {
        printk("TCP not connected\r\n");
        return -ENOTCONN;
    }

    int64_t deadline = k_uptime_get() + TCP_UPDATE_WAIT_MS;
    int total_events = 0;
    while (k_uptime_get() < deadline) {
        struct zsock_pollfd pfd = {
            .fd = state.tcp_fd,
            .events = ZSOCK_POLLIN,
            .revents = 0,
        };
        int remaining = (int)(deadline - k_uptime_get());
        int poll_ms = MIN(TCP_RECV_POLL_MS, MAX(1, remaining));
        int pr = zsock_poll(&pfd, 1, poll_ms);
        if (pr == 0) {
            if (total_events > 0 && !awaiting_settings_packet) {
                return 0;
            }
            continue;
        }
        if (pr < 0) {
            printk("poll failed: errno=%d\r\n", errno);
            return -errno;
        }
        ssize_t n = zsock_recv(state.tcp_fd, transport_buffers.binary,
                               sizeof(transport_buffers.binary), 0);
        if (n == 0) {
            printk("Server closed TCP socket\r\n");
            if (awaiting_settings_packet) {
                printk("Connection closed before settings packet completed\r\n");
            }
            tcp_disconnect();
            return -ECONNRESET;
        }
        if (n < 0) {
            printk("TCP recv failed: errno=%d\r\n", errno);
            return -errno;
        }
        printk("Server response chunk (%d bytes)\r\n", (int)n);
        int events = process_server_response_bytes(transport_buffers.binary,
                                                   (size_t)n, "tcp");
        if (events < 0) {
            return events;
        }
        total_events += events;
        if (total_events > 0 && !awaiting_settings_packet && server_response_buffer_len == 0U) {
            return 0;
        }
    }

    if (awaiting_settings_packet) {
        printk("Timed out while waiting for complete settings packet\r\n");
        awaiting_settings_packet = false;
        server_response_buffer_len = 0U;
        return -ETIMEDOUT;
    }
    printk("No complete server response within %d ms\r\n", TCP_UPDATE_WAIT_MS);
    return 0;
}

static int tcp_send_hex_payload(const char *hex)
{
    if (!state.tcp_connected || state.tcp_fd < 0) {
        printk("TCP not connected. Use: connect <ip> <port>\r\n");
        return -ENOTCONN;
    }

    uint8_t *bin = transport_buffers.binary;
    size_t bin_len = 0;
    int err = hex_to_bytes(hex, bin, sizeof(transport_buffers.binary), &bin_len);
    if (err) {
        printk("Invalid hex string; error=%d\r\n", err);
        return err;
    }

    if (state.mode == WIRE_ASCII_HEX) {
        size_t len = strlen(hex);
        const char *p = hex;
        while (len > 0) {
            ssize_t n = zsock_send(state.tcp_fd, p, len, 0);
            if (n < 0) {
                printk("TCP send failed: errno=%d\r\n", errno);
                tcp_disconnect();
                return -errno;
            }
            p += n;
            len -= (size_t)n;
        }
        printk("Sent ASCII hex (%u chars)\r\n", (unsigned int)strlen(hex));
    } else {
        size_t remaining = bin_len;
        uint8_t *p = bin;
        while (remaining > 0) {
            ssize_t n = zsock_send(state.tcp_fd, p, remaining, 0);
            if (n < 0) {
                printk("TCP send failed: errno=%d\r\n", errno);
                tcp_disconnect();
                return -errno;
            }
            p += n;
            remaining -= (size_t)n;
        }
        printk("Sent binary packet (%u bytes)\r\n", (unsigned int)bin_len);
    }

    tcp_recv_response();
    return 0;
}


static const char *transport_name(void)
{
    return state.transport == TRANSPORT_LTE_TCP ? "lte" : "relay";
}

static void relay_disconnect(void)
{
    if (state.relay_connected) {
        printk("MICRO_RELAY_DISCONNECT\r\n");
    }
    state.relay_connected = false;
    (void)k_timer_stop(&micro_heartbeat_timer);
    printk("Relay disconnected\r\n");
}

static int relay_connect_to_server(const char *ip, uint16_t port)
{
    if (ip == NULL || ip[0] == '\0') {
        return -EINVAL;
    }

    strncpy(state.server_ip, ip, sizeof(state.server_ip) - 1);
    state.server_ip[sizeof(state.server_ip) - 1] = '\0';
    state.server_port = port;
    state.relay_connected = false;

    printk("MICRO_RELAY_CONNECT:%s:%u\r\n", state.server_ip, state.server_port);
    printk("Relay connection requested. Wait for MICRO_RELAY_CONNECTED.\r\n");
    return 0;
}

static int relay_send_hex_payload(const char *hex)
{
    uint8_t *bin = transport_buffers.binary;
    size_t bin_len = 0;
    int err = hex_to_bytes(hex, bin, sizeof(transport_buffers.binary), &bin_len);
    if (err) {
        printk("Invalid hex string; error=%d\r\n", err);
        return err;
    }

    if (!state.relay_connected) {
        printk("Relay is not connected. Run: connect <ip> <port>\r\n");
        return -ENOTCONN;
    }

