Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
    if (state.mode == WIRE_ASCII_HEX) {
        printk("MICRO_RELAY_TX_ASCII_HEX:%s\r\n", hex);
        printk("Queued ASCII hex for Windows relay (%u chars)\r\n",
            (unsigned int)strlen(hex));
    } else {
        printk("MICRO_RELAY_TX_BINARY_HEX:%s\r\n", hex);
        printk("Queued binary packet for Windows relay (%u bytes)\r\n",
            (unsigned int)bin_len);
    }

    return 0;
}

static int transport_send_hex_payload(const char *hex)
{
    if (state.transport == TRANSPORT_SERIAL_RELAY) {
        return relay_send_hex_payload(hex);
    }

    if (!state.lte_registered) {
        printk("LTE is not connected. Run: lte connect, or use: transport relay\r\n");
        return -ENETDOWN;
    }

    return tcp_send_hex_payload(hex);
}


static bool transport_is_connected(void)
{
    return state.transport == TRANSPORT_SERIAL_RELAY ? state.relay_connected : state.tcp_connected;
}

static void log_thread_stack_usage(const char *phase, k_tid_t thread)
{
    size_t unused;
    if (thread == NULL) {
        return;
    }

    const char *name = k_thread_name_get(thread);
    if (name == NULL || name[0] == '\0') {
        name = "unnamed";
    }

    if (k_thread_stack_space_get(thread, &unused) == 0) {
        size_t size = thread->stack_info.size;
        printk("STACK %s: %s unused=%u used=%u size=%u\r\n",
               phase, name, (unsigned int)unused,
               (unsigned int)(size - unused), (unsigned int)size);
    } else {
        printk("STACK %s: %s unavailable\r\n", phase, name);
    }
}

static void log_relevant_stack_usage(const char *phase)
{
    printk("STACK SNAPSHOT: %s\r\n", phase);
    log_thread_stack_usage(phase, micro_main_thread);
    log_thread_stack_usage(phase, micro_heartbeat);
    log_thread_stack_usage(phase, k_work_queue_thread_get(&k_sys_work_q));

}

static void schedule_next_heartbeat(void)
{
    if (!transport_is_connected()) {
        (void)k_timer_stop(&micro_heartbeat_timer);
        return;
    }
    uint32_t interval = active_config.heartbeat_interval_seconds;
    if (interval == 0U) {
        interval = 60U;
    }
    (void)k_timer_start(&micro_heartbeat_timer, K_SECONDS(interval), K_NO_WAIT);
    printk("Next automatic heartbeat scheduled in %u seconds\r\n", interval);
}

static void heartbeat_timer_expiry(struct k_timer *timer)
{
    ARG_UNUSED(timer);
    k_sem_give(&micro_heartbeat_trigger);
}

static void heartbeat_thread(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1);
    ARG_UNUSED(p2);
    ARG_UNUSED(p3);

    (void)k_thread_name_set(k_current_get(), "micro_heartbeat");

    while (true) {
        (void)k_sem_take(&micro_heartbeat_trigger, K_FOREVER);
        if (!transport_is_connected()) {
            continue;
        }

        (void)k_mutex_lock(&micro_transport_mutex, K_FOREVER);
        log_relevant_stack_usage("micro_heartbeat-before");

        int err = build_heartbeat_hex(transport_buffers.hex,
                                      sizeof(transport_buffers.hex));
        if (err == 0) {
            printk("Automatic heartbeat sent: %s\r\n", transport_buffers.hex);
            err = transport_send_hex_payload(transport_buffers.hex);
        }
        if (err != 0) {
            printk("Automatic heartbeat failed: %d\r\n", err);
        }

        /* The stack snapshot captures the deepest mark left by the completed
         * send, including TCP receive and SUP/settings parsing when applicable.
         */
        log_relevant_stack_usage("micro_heartbeat-after");
        schedule_next_heartbeat();
        (void)k_mutex_unlock(&micro_transport_mutex);
    }
}

static bool handle_relay_control_line(const char *line)
{
    static const char connected_prefix[] = "MICRO_RELAY_CONNECTED:";
    static const char rx_prefix[] = "MICRO_RELAY_RX_HEX:";
    static const char error_prefix[] = "MICRO_RELAY_RX_ERROR:";

    if (strncmp(line, connected_prefix, strlen(connected_prefix)) == 0) {
        state.relay_connected = true;
        printk("Windows relay connected to %s\r\n", line + strlen(connected_prefix));
        schedule_next_heartbeat();
        return true;
    }

    if (strcmp(line, "MICRO_RELAY_DISCONNECTED") == 0) {
        state.relay_connected = false;
        printk("Windows relay disconnected\r\n");
        return true;
    }

    if (strcmp(line, "MICRO_RELAY_RX_EMPTY") == 0) {
        printk("Relay server returned no response\r\n");
        return true;
    }

    if (strncmp(line, error_prefix, strlen(error_prefix)) == 0) {
        state.relay_connected = false;
        printk("Relay error: %s\r\n", line + strlen(error_prefix));
        return true;
    }

    if (strncmp(line, rx_prefix, strlen(rx_prefix)) == 0) {
        const char *hex = line + strlen(rx_prefix);
        size_t resp_len = 0;
        int err = hex_to_bytes(hex, transport_buffers.binary,
                               sizeof(transport_buffers.binary), &resp_len);
        if (err) {
            printk("Invalid relay response HEX: %d\r\n", err);
        } else {
            int processed = process_server_response_bytes(transport_buffers.binary,
                                                          resp_len, "relay");
            if (processed < 0) {
                printk("Relay response parser failed: %d\r\n", processed);
            }
        }
        return true;
    }

    return false;
}

static int parse_scaled_i32(const char *s, int32_t scale, int32_t *out)
{
    bool neg = false;
    int64_t whole = 0;
    int64_t frac = 0;
    int64_t frac_scale = 1;
    const char *p = s;

    if (*p == '-') {
        neg = true;
        p++;
    } else if (*p == '+') {
        p++;
    }

    if (!isdigit((unsigned char)*p)) {
        return -EINVAL;
    }

    while (isdigit((unsigned char)*p)) {
        whole = (whole * 10) + (*p - '0');
        p++;
    }

    if (*p == '.') {
        p++;
        while (isdigit((unsigned char)*p) && frac_scale < scale) {
            frac = (frac * 10) + (*p - '0');
            frac_scale *= 10;
            p++;
        }
        while (isdigit((unsigned char)*p)) {
            p++;
        }
    }

    if (*p != '\0') {
        return -EINVAL;
    }

