Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
    int64_t value = (whole * scale) + ((frac * scale) / frac_scale);
    if (neg) {
        value = -value;
    }

    if (value > INT32_MAX || value < INT32_MIN) {
        return -ERANGE;
    }

    *out = (int32_t)value;
    return 0;
}

static int parse_u64(const char *s, uint64_t *out)
{
    if (s == NULL || s[0] == '\0' || s[0] == '-') {
        return -EINVAL;
    }

    errno = 0;
    char *end = NULL;
    unsigned long long v = strtoull(s, &end, 10);
    if (errno == ERANGE || end == s || *end != '\0') {
        return -EINVAL;
    }

    *out = (uint64_t)v;
    return 0;
}

static int parse_u32(const char *s, uint32_t *out)
{
    uint64_t value;
    if (parse_u64(s, &value) || value > UINT32_MAX) {
        return -EINVAL;
    }
    *out = (uint32_t)value;
    return 0;
}

static int parse_u16(const char *s, uint16_t *out)
{
    uint64_t value;
    if (parse_u64(s, &value) || value > UINT16_MAX) {
        return -EINVAL;
    }
    *out = (uint16_t)value;
    return 0;
}

static int parse_u8(const char *s, uint8_t *out)
{
    uint16_t tmp;
    int err = parse_u16(s, &tmp);
    if (err || tmp > 255) {
        return -EINVAL;
    }
    *out = (uint8_t)tmp;
    return 0;
}

static int parse_hex6(const char *s, uint8_t out[6])
{
    size_t len = strlen(s);
    if (len != 12) {
        return -EINVAL;
    }

    for (size_t i = 0; i < 6; i++) {
        int hi = hex_nibble(s[i * 2]);
        int lo = hex_nibble(s[(i * 2) + 1]);
        if (hi < 0 || lo < 0) {
            return -EINVAL;
        }
        out[i] = (uint8_t)((hi << 4) | lo);
    }

    return 0;
}

static const char *mode_name(void)
{
    return state.mode == WIRE_ASCII_HEX ? "ascii_hex" : "binary";
}

static const char *opcode_name(uint8_t opcode)
{
    switch (opcode) {
    case OPCODE_BEACON: return "beacon";
    case OPCODE_GPS_SAFEZONE: return "gps_safezone";
    case OPCODE_GPS_LTE: return "gps_lte";
    case OPCODE_TRUSTED: return "trusted";
    default: return "unknown";
    }
}

static const char *softsim_status_name(void)
{
    return state.softsim_provisioned ? "provisioned" : "not provisioned";
}

static const char *lte_status_name(void)
{
    if (state.lte_registered) {
        return "connected";
    }
    if (state.lte_connecting) {
        return "connecting";
    }
    return "disconnected";
}

static void print_help(void)
{
    printk("\r\nMicro simulator commands:\r\n");
    printk("  help\r\n");
    printk("  status\r\n");
    printk("  transport lte|relay\r\n");
    printk("  softsim status\r\n");
    printk("  softsim provision\r\n");
    printk("  lte status\r\n");
    printk("  lte connect\r\n");
    printk("  connect [ip] [port]\r\n");
    printk("  disconnect\r\n");
    printk("  recv\r\n");
    printk("  mode ascii_hex|binary\r\n");
    printk("  send sample_hb_beacon\r\n");
    printk("  send sample_hb_gps\r\n");
    printk("  send sample_location\r\n");
    printk("  send hb\r\n");
    printk("  send loc\r\n");
    printk("  send raw <HEX>\r\n");
    printk("  config show\r\n");
    printk("  config generate <setting_name> <value>\r\n");
    printk("  config apply <complete_packet_hex>\r\n");
    printk("  config set <setting_name> <value>\r\n");
    printk("  config reset confirm\r\n");
    printk("  config last\r\n");
    printk("  preset normal|low|charging|outside|beacon|trusted\r\n");
    printk("  set battery low|medium|high\r\n");
    printk("  set charging on|off\r\n");
    printk("  set opcode beacon|trusted|gps_lte|gps_safezone\r\n");
    printk("  set pos <lat> <lon> <accuracy_m> <speed_mps>\r\n");
    printk("  set imei <digits>\r\n");
    printk("  set lastupdate <minutes>\r\n");
    printk("  set timestamp <unix_ms>\r\n");
    printk("  set time_mode fixed|running|step\r\n");
    printk("  set time_step <milliseconds>\r\n");
    printk("  set fixage <seconds>\r\n");
    printk("  set versions <sw> <fw>\r\n");
    printk("  set beacon <12_hex_chars>\r\n");
    printk("  set trusted <12_hex_chars>\r\n\r\n");
}

static void print_hex6(const uint8_t v[6])
{
    for (size_t i = 0; i < 6; i++) {
        printk("%02X", v[i]);
    }
}

static void print_status(void)
{
    printk("\r\nStatus:\r\n");
    printk("  transport: %s\r\n", transport_name());
    printk("  SoftSIM: %s\r\n", softsim_status_name());
    printk("  LTE: %s\r\n", lte_status_name());
    printk("  LTE TCP: %s\r\n", state.tcp_connected ? "connected" : "disconnected");
    printk("  Windows relay: %s\r\n", state.relay_connected ? "connected" : "disconnected");
    printk("  server: %s:%u\r\n", state.server_ip, state.server_port);
    printk("  mode: %s\r\n", mode_name());
    printk("  sequence_id: %u\r\n", state.sequence_id);
    printk("  imei: %s\r\n", state.imei);
    printk("  battery: 0x%02X\r\n", state.battery);
    printk("  charging: 0x%02X\r\n", state.charging);
    printk("  last_update: %u minutes\r\n", state.last_update);
    printk("  timestamp: %llu ms since Unix epoch (UTC)\r\n",
           (unsigned long long)simulated_current_time_ms());
    printk("  time_mode: %s; step=%llu ms; location_fix_age=%u s\r\n",
           timestamp_mode_name(),
           (unsigned long long)state.timestamp_step_ms,
           state.location_fix_age_seconds);
    printk("  versions: sw=%u fw=%u\r\n", state.sw_version, state.fw_version);
    printk("  opcode: 0x%02X (%s)\r\n", state.opcode, opcode_name(state.opcode));
    printk("  lat_e6: %d lon_e6: %d\r\n", state.lat_e6, state.lon_e6);
    printk("  accuracy_x10: %u speed_x10: %u\r\n", state.accuracy_x10, state.speed_x10);
    printk("  beacon: "); print_hex6(state.beacon_mac); printk("\r\n");
    printk("  detected trusted: "); print_hex6(state.trusted_addr); printk("\r\n");
    printk("  persistent heartbeat_interval_seconds: %u\r\n", active_config.heartbeat_interval_seconds);
    printk("  configured trusted devices: %u\r\n", active_config.trusted_device_count);
    for (uint8_t i = 0U; i < active_config.trusted_device_count; ++i) {
        printk("    slot %u: ", i + 1U); print_hex6(active_config.trusted_devices[i]); printk("\r\n");
    }
    printk("\r\n");
}

static void apply_preset(const char *preset)
{
    if (strcmp(preset, "normal") == 0) {
        state.battery = 0x01;
        state.charging = 0x01;
        state.opcode = OPCODE_BEACON;
    } else if (strcmp(preset, "low") == 0) {
        state.battery = 0x00;
        state.charging = 0x01;
    } else if (strcmp(preset, "charging") == 0) {
        state.battery = 0x01;
        state.charging = 0x10;
    } else if (strcmp(preset, "outside") == 0) {
        state.opcode = OPCODE_GPS_LTE;
        state.lat_e6 = 45450000;
        state.lon_e6 = -75750000;
        state.accuracy_x10 = 300;
        state.speed_x10 = 12;
    } else if (strcmp(preset, "beacon") == 0) {
        state.opcode = OPCODE_BEACON;
    } else if (strcmp(preset, "trusted") == 0) {
        state.opcode = OPCODE_TRUSTED;
    } else {
        printk("Unknown preset: %s\r\n", preset);
        return;
    }

