Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
    printk("Applied preset: %s\r\n", preset);
}

static char *trim_left(char *s)
{
    while (s && isspace((unsigned char)*s)) {
        s++;
    }
    return s;
}

static void split_first(char *line, char **first, char **rest)
{
    line = trim_left(line);
    *first = line;
    *rest = NULL;

    if (line == NULL || line[0] == '\0') {
        *first = NULL;
        return;
    }

    char *space = line;
    while (*space != '\0' && !isspace((unsigned char)*space)) {
        space++;
    }

    if (*space != '\0') {
        *space = '\0';
        *rest = trim_left(space + 1);
    }
}

static void handle_send_command(char *args)
{
    char *what = NULL;
    char *rest = NULL;
    char *hex = transport_buffers.hex;

    split_first(args, &what, &rest);

    if (what == NULL) {
        printk("Usage: send <sample_hb_beacon|sample_hb_gps|sample_location|hb|loc|raw>\r\n");
        return;
    }

    if (strcmp(what, "sample_hb_beacon") == 0) {
        transport_send_hex_payload(SAMPLE_HB_BEACON);
    } else if (strcmp(what, "sample_hb_gps") == 0) {
        transport_send_hex_payload(SAMPLE_HB_GPS);
    } else if (strcmp(what, "sample_location") == 0) {
        transport_send_hex_payload(SAMPLE_LOCATION);
    } else if (strcmp(what, "hb") == 0) {
        int err = build_heartbeat_hex(hex, sizeof(transport_buffers.hex));
        if (err) {
            printk("Failed to build heartbeat packet: %d\r\n", err);
            return;
        }
        printk("Dynamic heartbeat hex: %s\r\n", hex);
        transport_send_hex_payload(hex);
    } else if (strcmp(what, "loc") == 0) {
        int err = build_location_hex(hex, sizeof(transport_buffers.hex));
        if (err) {
            printk("Failed to build location packet: %d\r\n", err);
            return;
        }
        printk("Dynamic location hex: %s\r\n", hex);
        transport_send_hex_payload(hex);
    } else if (strcmp(what, "raw") == 0) {
        if (rest == NULL || rest[0] == '\0') {
            printk("Usage: send raw <HEX>\r\n");
            return;
        }
        transport_send_hex_payload(rest);
    } else {
        printk("Unknown send target: %s\r\n", what);
    }
}

static void handle_set_command(char *args)
{
    char *field = strtok(args, " ");

    if (field == NULL) {
        printk("Usage: set <field> <value>\r\n");
        return;
    }

    if (strcmp(field, "battery") == 0) {
        char *v = strtok(NULL, " ");
        if (!v) { printk("Usage: set battery low|medium|high\r\n"); return; }
        if (strcmp(v, "low") == 0) state.battery = 0x00;
        else if (strcmp(v, "medium") == 0) state.battery = 0x01;
        else if (strcmp(v, "high") == 0) state.battery = 0x10;
        else { printk("Invalid battery value\r\n"); return; }
        printk("battery set\r\n");
    } else if (strcmp(field, "charging") == 0) {
        char *v = strtok(NULL, " ");
        if (!v) { printk("Usage: set charging on|off\r\n"); return; }
        if (strcmp(v, "on") == 0) state.charging = 0x10;
        else if (strcmp(v, "off") == 0) state.charging = 0x01;
        else { printk("Invalid charging value\r\n"); return; }
        printk("charging set\r\n");
    } else if (strcmp(field, "opcode") == 0) {
        char *v = strtok(NULL, " ");
        if (!v) { printk("Usage: set opcode beacon|trusted|gps_lte|gps_safezone\r\n"); return; }
        if (strcmp(v, "beacon") == 0) state.opcode = OPCODE_BEACON;
        else if (strcmp(v, "trusted") == 0) state.opcode = OPCODE_TRUSTED;
        else if (strcmp(v, "gps_lte") == 0) state.opcode = OPCODE_GPS_LTE;
        else if (strcmp(v, "gps_safezone") == 0) state.opcode = OPCODE_GPS_SAFEZONE;
        else { printk("Invalid opcode\r\n"); return; }
        printk("opcode set to %s\r\n", opcode_name(state.opcode));
    } else if (strcmp(field, "pos") == 0) {
        char *lat = strtok(NULL, " ");
        char *lon = strtok(NULL, " ");
        char *acc = strtok(NULL, " ");
        char *spd = strtok(NULL, " ");
        int32_t lat_e6, lon_e6, acc_x10, spd_x10;
        if (!lat || !lon || !acc || !spd) {
            printk("Usage: set pos <lat> <lon> <accuracy_m> <speed_mps>\r\n"); return;
        }
        if (parse_scaled_i32(lat, 1000000, &lat_e6) ||
            parse_scaled_i32(lon, 1000000, &lon_e6) ||
            parse_scaled_i32(acc, 10, &acc_x10) ||
            parse_scaled_i32(spd, 10, &spd_x10) ||
            lat_e6 < -90000000 || lat_e6 > 90000000 ||
            lon_e6 < -180000000 || lon_e6 > 180000000 ||
            acc_x10 < 0 || spd_x10 < 0 ||
            acc_x10 > 65535 || spd_x10 > 65535) {
            printk("Invalid pos values. Latitude must be -90..90, longitude -180..180, "
                   "and accuracy/speed must be non-negative.\r\n");
            return;
        }
        state.lat_e6 = lat_e6;
        state.lon_e6 = lon_e6;
        state.accuracy_x10 = (uint16_t)acc_x10;
        state.speed_x10 = (uint16_t)spd_x10;
        printk("position set\r\n");
    } else if (strcmp(field, "imei") == 0) {
        char *v = strtok(NULL, " ");
        if (!v || strlen(v) != 15) {
            printk("Usage: set imei <15_digits>\r\n");
            return;
        }
        for (size_t i = 0; i < 15; i++) {
            if (!isdigit((unsigned char)v[i])) {
                printk("IMEI must contain exactly 15 decimal digits\r\n");
                return;
            }
        }
        strncpy(state.imei, v, sizeof(state.imei) - 1);
        state.imei[sizeof(state.imei) - 1] = '\0';
        printk("imei set\r\n");
    } else if (strcmp(field, "lastupdate") == 0) {
        char *v = strtok(NULL, " ");
        uint16_t out;
        if (!v || parse_u16(v, &out)) { printk("Usage: set lastupdate <minutes>\r\n"); return; }
        state.last_update = out;
        printk("lastupdate set\r\n");
    } else if (strcmp(field, "timestamp") == 0) {
        char *v = strtok(NULL, " ");
        uint64_t timestamp_ms;
        if (!v || parse_u64(v, &timestamp_ms)) {
            printk("Usage: set timestamp <unix_ms>\r\n");
            return;
        }
        state.timestamp_base_ms = timestamp_ms;
        reset_timestamp_uptime_anchor();
        printk("timestamp set to %llu ms since Unix epoch UTC\r\n",
               (unsigned long long)state.timestamp_base_ms);
    } else if (strcmp(field, "time_mode") == 0) {
        char *v = strtok(NULL, " ");
        if (!v) {
            printk("Usage: set time_mode fixed|running|step\r\n");
            return;
        }

