Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
        uint64_t current_ms = simulated_current_time_ms();
        if (strcmp(v, "fixed") == 0) {
            state.timestamp_mode = TIMESTAMP_FIXED;
        } else if (strcmp(v, "running") == 0) {
            state.timestamp_mode = TIMESTAMP_RUNNING;
        } else if (strcmp(v, "step") == 0) {
            state.timestamp_mode = TIMESTAMP_STEP;
        } else {
            printk("Usage: set time_mode fixed|running|step\r\n");
            return;
        }
        state.timestamp_base_ms = current_ms;
        reset_timestamp_uptime_anchor();
        printk("time mode set to %s\r\n", timestamp_mode_name());
    } else if (strcmp(field, "time_step") == 0) {
        char *v = strtok(NULL, " ");
        uint64_t step_ms;
        if (!v || parse_u64(v, &step_ms) || step_ms == 0) {
            printk("Usage: set time_step <positive_milliseconds>\r\n");
            return;
        }
        state.timestamp_step_ms = step_ms;
        printk("timestamp step set to %llu ms per generated packet\r\n",
               (unsigned long long)state.timestamp_step_ms);
    } else if (strcmp(field, "fixage") == 0) {
        char *v = strtok(NULL, " ");
        uint32_t seconds;
        if (!v || parse_u32(v, &seconds)) {
            printk("Usage: set fixage <seconds>\r\n");
            return;
        }
        state.location_fix_age_seconds = seconds;
        printk("location fix age set to %u seconds\r\n",
               state.location_fix_age_seconds);
    } else if (strcmp(field, "versions") == 0) {
        char *sw = strtok(NULL, " ");
        char *fw = strtok(NULL, " ");
        uint8_t swv, fwv;
        if (!sw || !fw || parse_u8(sw, &swv) || parse_u8(fw, &fwv)) {
            printk("Usage: set versions <sw> <fw>\r\n"); return;
        }
        state.sw_version = swv;
        state.fw_version = fwv;
        printk("versions set\r\n");
    } else if (strcmp(field, "beacon") == 0) {
        char *v = strtok(NULL, " ");
        if (!v || parse_hex6(v, state.beacon_mac)) { printk("Usage: set beacon <12_hex_chars>\r\n"); return; }
        printk("beacon set\r\n");
    } else if (strcmp(field, "trusted") == 0) {
        char *v = strtok(NULL, " ");
        if (!v || parse_hex6(v, state.trusted_addr)) { printk("Usage: set trusted <12_hex_chars>\r\n"); return; }
        printk("trusted set\r\n");
    } else {
        printk("Unknown field: %s\r\n", field);
    }
}


static void print_persistent_config(void)
{
    printk("\r\nPersistent configuration:\r\n");
    printk("  heartbeat_interval_seconds: %u (range 1..65535; default 60)\r\n",
           active_config.heartbeat_interval_seconds);
    printk("  lte_update_interval_seconds: %u (range 1..65535; default 480)\r\n",
           active_config.lte_update_interval_seconds);
    printk("  sleep_interval_seconds: %u (range 1..65535; default 480)\r\n",
           active_config.sleep_interval_seconds);
    printk("  safe_zones: %u\r\n", active_config.zone_count);
    for (uint8_t i = 0U; i < active_config.zone_count; ++i) {
        printk("    %u: lat_e7=%d lon_e7=%d radius_m=%u\r\n", i + 1U,
               active_config.zones[i].latitude_e7,
               active_config.zones[i].longitude_e7,
               active_config.zones[i].radius_m);
    }
    printk("  beacons: %u\r\n", active_config.beacon_count);
    for (uint8_t i = 0U; i < active_config.beacon_count; ++i) {
        printk("    %u: ", i + 1U); print_hex6(active_config.beacons[i]); printk("\r\n");
    }
    printk("  trusted_devices: %u\r\n", active_config.trusted_device_count);
    for (uint8_t i = 0U; i < active_config.trusted_device_count; ++i) {
        printk("    %u: ", i + 1U); print_hex6(active_config.trusted_devices[i]); printk("\r\n");
    }
}

static void print_last_config_update(void)
{
    printk("\r\nLast configuration update:\r\n");
    printk("  update_id: %u\r\n", last_config_result.update_id);
    printk("  source: %s\r\n", last_config_source);
    printk("  uptime_ms: %u\r\n", last_config_uptime_ms);
    printk("  result: %s (%d)\r\n", last_config_status == 0 ? "success" : "failure",
           last_config_status);
    printk("  changed_count: %u\r\n", last_config_result.changed_count);
    for (uint8_t i = 0U; i < last_config_result.changed_count; ++i) {
        const struct micro_setting_definition *definition =
            micro_setting_by_id(last_config_result.changed_ids[i]);
        printk("    %u: 0x%02X %s\r\n", i + 1U,
               last_config_result.changed_ids[i],
               definition != NULL ? definition->name : "unknown");
    }
    if (last_config_error[0] != '\0') {
        printk("  validation_error: %s\r\n", last_config_error);
    }
}

static void handle_config_command(char *args)
{
    char *action = NULL;
    char *rest = NULL;
    split_first(args ? args : "", &action, &rest);
    if (action == NULL || strcmp(action, "show") == 0) {
        print_persistent_config();
        return;
    }
    if (strcmp(action, "last") == 0) {
        print_last_config_update();
        return;
    }
    if (strcmp(action, "generate") == 0 || strcmp(action, "set") == 0) {
        char *name = NULL;
        char *value = NULL;
        char *tail = NULL;
        split_first(rest ? rest : "", &name, &tail);
        split_first(tail ? tail : "", &value, &tail);
        if (name == NULL || value == NULL || (tail != NULL && tail[0] != '\0')) {
            printk("Usage: config %s <setting_name> <value>\r\n", action);
            return;
        }
        char *hex = transport_buffers.hex;
        uint16_t update_id = 0U;
        int err = build_settings_update_hex(name, value, hex,
                                            sizeof(transport_buffers.hex), &update_id);
        if (err != 0) {
            printk("Could not generate settings packet: %d\r\n", err);
            return;
        }
        printk("Generated settings packet (update_id=%u): %s\r\n", update_id, hex);
        if (strcmp(action, "generate") == 0) {
            printk("Packet was not applied.\r\n");
            return;
        }
        uint8_t *packet = transport_buffers.packet;
        size_t packet_len = 0U;
        err = hex_to_bytes(hex, packet, MAX_PACKET_BYTES, &packet_len);
        if (err == 0) {
            err = apply_settings_packet_bytes(packet, packet_len, "serial");
        }
        if (err != 0) {
            printk("config set failed: %d\r\n", err);
        }
        return;
    }
    if (strcmp(action, "apply") == 0) {
        if (rest == NULL || rest[0] == '\0') {
            printk("Usage: config apply <complete_packet_hex>\r\n");
            return;
        }
        uint8_t *packet = transport_buffers.packet;
        size_t packet_len = 0U;
        int err = hex_to_bytes(rest, packet, MAX_PACKET_BYTES, &packet_len);
        if (err != 0) {
            printk("Malformed packet HEX: %d\r\n", err);
            return;
        }
        err = apply_settings_packet_bytes(packet, packet_len, "serial");
        if (err != 0) {
            printk("config apply failed: %d\r\n", err);
        }
        return;
    }
    if (strcmp(action, "reset") == 0) {
        if (rest == NULL || strcmp(rest, "confirm") != 0) {
            printk("Development reset requires: config reset confirm\r\n");
            return;
        }
        struct micro_persistent_config defaults;
        micro_settings_defaults(&defaults);
        char *hex = transport_buffers.hex;
        uint16_t update_id = 0U;
        int err = build_settings_config_update_hex(&defaults, hex,
                                                   sizeof(transport_buffers.hex),
                                                   &update_id);
        if (err != 0) {
            printk("Could not generate defaults update packet: %d\r\n", err);
            return;
        }
        printk("Generated defaults packet (update_id=%u): %s\r\n", update_id, hex);
        uint8_t *packet = transport_buffers.packet;
        size_t packet_len = 0U;
        err = hex_to_bytes(hex, packet, MAX_PACKET_BYTES, &packet_len);
        if (err == 0) {
            err = apply_settings_packet_bytes(packet, packet_len, "serial-reset");
        }
        if (err != 0) {
            printk("Could not restore configuration defaults: %d\r\n", err);
            return;
        }
        printk("Persistent configuration restored through the normal settings packet flow\r\n");
        return;
    }
    printk("Usage: config show|generate|apply|set|reset confirm|last\r\n");
}

static void handle_transport_command(char *args)
{
    char *value = NULL;
    char *tail = NULL;
    split_first(args ? args : "", &value, &tail);

    if (!value) {
        printk("Usage: transport lte|relay\r\n");
        return;
    }

    if (strcmp(value, "lte") == 0) {
        relay_disconnect();
        state.transport = TRANSPORT_LTE_TCP;
        printk("transport set to lte\r\n");
        if (!state.softsim_provisioned) {
            printk("SoftSIM is not provisioned. LTE transport cannot connect yet.\r\n");
        } else if (!state.lte_registered) {
            printk("Run: lte connect\r\n");
        }
    } else if (strcmp(value, "relay") == 0) {
        state.transport = TRANSPORT_SERIAL_RELAY;
        tcp_disconnect();
        printk("transport set to relay\r\n");
        printk("Run the Windows relay script, then use: connect <ip> <port>\r\n");
    } else {
        printk("Usage: transport lte|relay\r\n");
    }
}

