Alaghai/NRF9151-Simulator-Guides/Micro_Simulator_Dual_Transport_Complete_v6_settings_update/Micro_Simulator_Dual_Transport_Complete_v6/applications/micro_simulator/src/main.c
static void handle_softsim_command(char *args)
{
    char *value = NULL;
    char *tail = NULL;
    split_first(args ? args : "", &value, &tail);

    if (!value || strcmp(value, "status") == 0) {
        printk("SoftSIM: %s\r\n", softsim_status_name());
        return;
    }

    if (strcmp(value, "provision") == 0) {
        if (state.softsim_provisioned) {
            printk("SoftSIM is already provisioned. Provisioning again is not required.\r\n");
            return;
        }

        int err = provision_softsim_from_serial();
        if (err) {
            printk("SoftSIM provisioning failed: %d\r\n", err);
        }
        return;
    }

    printk("Usage: softsim status|provision\r\n");
}

static void handle_lte_command(char *args)
{
    char *value = NULL;
    char *tail = NULL;
    split_first(args ? args : "", &value, &tail);

    if (!value || strcmp(value, "status") == 0) {
        printk("LTE: %s\r\n", lte_status_name());
        return;
    }

    if (strcmp(value, "connect") == 0) {
        int err = lte_connect_start();
        if (err) {
            printk("LTE connect could not start: %d\r\n", err);
        }
        return;
    }

    printk("Usage: lte status|connect\r\n");
}

static void handle_command(char *line)
{
    char *cmd = NULL;
    char *rest = NULL;

    if (handle_relay_control_line(line)) {
        return;
    }

    split_first(line, &cmd, &rest);

    if (cmd == NULL || cmd[0] == '\0') {
        return;
    }

    if (strcmp(cmd, "help") == 0) {
        print_help();
    } else if (strcmp(cmd, "status") == 0) {
        print_status();
    } else if (strcmp(cmd, "transport") == 0) {
        handle_transport_command(rest ? rest : "");
    } else if (strcmp(cmd, "softsim") == 0) {
        handle_softsim_command(rest ? rest : "");
    } else if (strcmp(cmd, "lte") == 0) {
        handle_lte_command(rest ? rest : "");
    } else if (strcmp(cmd, "connect") == 0) {
        char *ip = NULL;
        char *port_s = NULL;
        char *tail = NULL;
        uint16_t port = state.server_port;

        split_first(rest ? rest : "", &ip, &tail);
        split_first(tail ? tail : "", &port_s, &tail);

        if (!ip) {
            ip = state.server_ip;
        }
        if (port_s && parse_u16(port_s, &port)) {
            printk("Invalid port\r\n");
            return;
        }

        if (state.transport == TRANSPORT_SERIAL_RELAY) {
            relay_connect_to_server(ip, port);
        } else {
            if (!state.lte_registered) {
                printk("LTE is not connected. Run: lte connect\r\n");
                return;
            }
            tcp_connect_to_server(ip, port);
        }
    } else if (strcmp(cmd, "disconnect") == 0) {
        if (state.transport == TRANSPORT_SERIAL_RELAY) {
            relay_disconnect();
        } else {
            tcp_disconnect();
        }
    } else if (strcmp(cmd, "recv") == 0) {
        if (state.transport == TRANSPORT_SERIAL_RELAY) {
            printk("Relay responses are returned automatically by the Windows relay script.\r\n");
        } else {
            tcp_recv_response();
        }
    } else if (strcmp(cmd, "mode") == 0) {
        char *v = NULL;
        char *tail = NULL;
        split_first(rest ? rest : "", &v, &tail);
        if (!v) { printk("Usage: mode ascii_hex|binary\r\n"); return; }
        if (strcmp(v, "ascii_hex") == 0) state.mode = WIRE_ASCII_HEX;
        else if (strcmp(v, "binary") == 0) state.mode = WIRE_BINARY;
        else { printk("Invalid mode\r\n"); return; }
        printk("mode set to %s\r\n", mode_name());
    } else if (strcmp(cmd, "send") == 0) {
        handle_send_command(rest ? rest : "");
    } else if (strcmp(cmd, "preset") == 0) {
        char *p = NULL;
        char *tail = NULL;
        split_first(rest ? rest : "", &p, &tail);
        if (!p) { printk("Usage: preset normal|low|charging|outside|beacon|trusted\r\n"); return; }
        apply_preset(p);
    } else if (strcmp(cmd, "set") == 0) {
        handle_set_command(rest ? rest : "");
    } else if (strcmp(cmd, "config") == 0) {
        handle_config_command(rest ? rest : "");
    } else {
        printk("Unknown command: %s. Type: help\r\n", cmd);
    }
}

static void cli_loop(void)
{
    char *line = cli_line;

    printk("\r\nSerial CLI ready. Type: help\r\n");
    printk("Transport: %s\r\n", transport_name());

    if (state.transport == TRANSPORT_SERIAL_RELAY) {
        printk("Start the Windows relay script, then run:\r\n");
        printk("  connect %s %u\r\n", state.server_ip, state.server_port);
    } else {
        printk("LTE connection starts in the background. Check with: lte status\r\n");
        printk("After LTE connects, run: connect %s %u\r\n",
            state.server_ip, state.server_port);
    }

    while (true) {
        printk("micro> ");
        int n = read_line_serial(line, sizeof(cli_line), true);
        if (n < 0) {
            printk("line read error: %d\r\n", n);
            continue;
        }
        (void)k_mutex_lock(&micro_transport_mutex, K_FOREVER);
        handle_command(line);
        (void)k_mutex_unlock(&micro_transport_mutex);
    }
}

int main(void)
{
    micro_main_thread = k_current_get();
    (void)k_thread_name_set(micro_main_thread, "main");
    printk("MICRO BUILD: heartbeat-worker-fix-v2\r\n");
    LOG_INF("Micro serial simulator started");

    if (calculate_crc16((const uint8_t *)"123456789", 9, 0x0000) != 0x31C3) {
        LOG_ERR("CRC-16/XMODEM self-test failed");
        return -EIO;
    }

    int err = serial_input_start();
    if (err) {
        return err;
    }

    last_config_status = -ENOENT;
    err = persistent_settings_init();
    if (err != 0) {
        LOG_ERR("Persistent simulator settings unavailable: %d", err);
        return err;
    }

    state.softsim_provisioned = nrf_softsim_check_provisioned();
    reset_timestamp_uptime_anchor();

    if (state.softsim_provisioned) {
        state.transport = TRANSPORT_LTE_TCP;
        LOG_INF("SoftSIM is provisioned");

        err = lte_connect_start();
        if (err) {
            LOG_WRN("LTE did not start. Serial relay mode remains available.");
        }
    } else {
        state.transport = TRANSPORT_SERIAL_RELAY;
        LOG_INF("SoftSIM is not provisioned");
        printk("\r\nThe simulator can run without SoftSIM using the Windows Wi-Fi relay.\r\n");
        printk("To provision SoftSIM later, run: softsim provision\r\n");
    }

    cli_loop();
    return 0;
}
